layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 800
      dim: 800
    }
  }
}
layer {
  name: "node121"
  type: "Convolution"
  bottom: "input"
  top: "node121"
  convolution_param {
    num_output: 8
    bias_term: true
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node122"
  type: "BatchNorm"
  bottom: "node121"
  top: "node122"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node122_scale"
  type: "Scale"
  bottom: "node122"
  top: "node122"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node123"
  type: "ReLU"
  bottom: "node122"
  top: "node122"
}
layer {
  name: "node124"
  type: "Convolution"
  bottom: "node122"
  top: "node124"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node125"
  type: "BatchNorm"
  bottom: "node124"
  top: "node125"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node125_scale"
  type: "Scale"
  bottom: "node125"
  top: "node125"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node126"
  type: "ReLU"
  bottom: "node125"
  top: "node125"
}
layer {
  name: "node127"
  type: "Convolution"
  bottom: "node125"
  top: "node127"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node128"
  type: "BatchNorm"
  bottom: "node127"
  top: "node128"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node128_scale"
  type: "Scale"
  bottom: "node128"
  top: "node128"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node129"
  type: "ReLU"
  bottom: "node128"
  top: "node128"
}
layer {
  name: "node130"
  type: "Convolution"
  bottom: "node128"
  top: "node130"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node131"
  type: "BatchNorm"
  bottom: "node130"
  top: "node131"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node131_scale"
  type: "Scale"
  bottom: "node131"
  top: "node131"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node132"
  type: "ReLU"
  bottom: "node131"
  top: "node131"
}
layer {
  name: "node133"
  type: "Convolution"
  bottom: "node131"
  top: "node133"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node134"
  type: "BatchNorm"
  bottom: "node133"
  top: "node134"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node134_scale"
  type: "Scale"
  bottom: "node134"
  top: "node134"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node135"
  type: "ReLU"
  bottom: "node134"
  top: "node134"
}
layer {
  name: "node136"
  type: "Convolution"
  bottom: "node134"
  top: "node136"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node137"
  type: "BatchNorm"
  bottom: "node136"
  top: "node137"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node137_scale"
  type: "Scale"
  bottom: "node137"
  top: "node137"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node138"
  type: "ReLU"
  bottom: "node137"
  top: "node137"
}
layer {
  name: "node139"
  type: "Convolution"
  bottom: "node137"
  top: "node139"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node140"
  type: "BatchNorm"
  bottom: "node139"
  top: "node140"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node140_scale"
  type: "Scale"
  bottom: "node140"
  top: "node140"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node141"
  type: "ReLU"
  bottom: "node140"
  top: "node140"
}
layer {
  name: "node142"
  type: "Convolution"
  bottom: "node140"
  top: "node142"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node143"
  type: "BatchNorm"
  bottom: "node142"
  top: "node143"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node143_scale"
  type: "Scale"
  bottom: "node143"
  top: "node143"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node144"
  type: "ReLU"
  bottom: "node143"
  top: "node143"
}
layer {
  name: "node145"
  type: "Convolution"
  bottom: "node143"
  top: "node145"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node146"
  type: "BatchNorm"
  bottom: "node145"
  top: "node146"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node146_scale"
  type: "Scale"
  bottom: "node146"
  top: "node146"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node147"
  type: "ReLU"
  bottom: "node146"
  top: "node146"
}
layer {
  name: "node148"
  type: "Convolution"
  bottom: "node146"
  top: "node148"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node149"
  type: "BatchNorm"
  bottom: "node148"
  top: "node149"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node149_scale"
  type: "Scale"
  bottom: "node149"
  top: "node149"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node150"
  type: "ReLU"
  bottom: "node149"
  top: "node149"
}
layer {
  name: "node151"
  type: "Convolution"
  bottom: "node149"
  top: "node151"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node152"
  type: "BatchNorm"
  bottom: "node151"
  top: "node152"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node152_scale"
  type: "Scale"
  bottom: "node152"
  top: "node152"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node153"
  type: "ReLU"
  bottom: "node152"
  top: "node152"
}
layer {
  name: "node154"
  type: "Convolution"
  bottom: "node152"
  top: "node154"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node155"
  type: "BatchNorm"
  bottom: "node154"
  top: "node155"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node155_scale"
  type: "Scale"
  bottom: "node155"
  top: "node155"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node156"
  type: "ReLU"
  bottom: "node155"
  top: "node155"
}
layer {
  name: "node157"
  type: "Convolution"
  bottom: "node155"
  top: "node157"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node158"
  type: "BatchNorm"
  bottom: "node157"
  top: "node158"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node158_scale"
  type: "Scale"
  bottom: "node158"
  top: "node158"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node159"
  type: "ReLU"
  bottom: "node158"
  top: "node158"
}
layer {
  name: "node160"
  type: "Convolution"
  bottom: "node158"
  top: "node160"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node161"
  type: "BatchNorm"
  bottom: "node160"
  top: "node161"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node161_scale"
  type: "Scale"
  bottom: "node161"
  top: "node161"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node162"
  type: "ReLU"
  bottom: "node161"
  top: "node161"
}
layer {
  name: "node163"
  type: "Convolution"
  bottom: "node161"
  top: "node163"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node164"
  type: "BatchNorm"
  bottom: "node163"
  top: "node164"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node164_scale"
  type: "Scale"
  bottom: "node164"
  top: "node164"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node165"
  type: "ReLU"
  bottom: "node164"
  top: "node164"
}
layer {
  name: "node166"
  type: "Convolution"
  bottom: "node164"
  top: "node166"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "node167"
  type: "BatchNorm"
  bottom: "node166"
  top: "node167"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "node167_scale"
  type: "Scale"
  bottom: "node167"
  top: "node167"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "node168"
  type: "ReLU"
  bottom: "node167"
  top: "node167"
}
layer {
  name: "node169"
  type: "Convolution"
  bottom: "node167"
  top: "node169"
  convolution_param {
    num_output: 25
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}

